сбор информации и предварительная подготовка

получить информационную и технологическую карточку услуги
пример заявления, бланки, шаблоны документов
реквизиты для оплаты (для платных услуг)
график приема граждан (для услуг с электронными очередями)
контакты ответственного лица за отработку заявок
Если необходимо - создать справочник административных органов по регионам - название, адрес, телефон, график работы. Путь к справочникам: i\wf-base\src\main\resources\patterns\dictionary
поставить задачу на гитхабе
разработка бизнес-процесса

создать новую диаграмму. Для Eclipse:New-Other-Activiti Diagram. Путь для размещения bpmn-файлов: \i\wf-egion\src\main\resources\bpmn\autodeploy. Правила при именовании бинес-процессов.
проработать инфокарты и бланки заявлений - составить перечень необходимых полей и условий
прорисовать всю схему процесса от начала до конца, наполнить блоки информацией.
создать принтформы
подключение всех необходимых сущностей

создать пользов* ателей и группы на дельте - связать их между собой

написать "Як це працює" в формате html. Путь для размещения файла:\i\wf-central\src\main\resources\patterns\services\Info
добавить файл с принтформой в формате html. Путь для размещения файла: i\wf-region\src\main\resources\pattern\print. Желательно использовать папку по конкретному органу или направлению.
заполнить Service, ServiceData, SubjectOrganJoin, SubjectOrgan
Если необходимо добавить населенный пункт которого нет в списке - добавить его в сущности Place, PlaceTree, City.
При необходимости - добавить электронные очереди.
Прописать эскалации.
тестирование и проливка на бету и боевой

перед каждой проливкой на сервер проект необходимо собирать и запускать локально
пройти процесс от начала до конца по всем возможным путям
выслать заказчику инструкцию, ссылки, логин и пароль.
в случае необходимости - вносить изменения в процесс. после внесения даже небольшого изменения - обязательное тестирование
создать пользователей и группы на дельте - связать их между собой
скопировать процессы в подпапки бета и прод. i\wf-region\src\main\resources\bpmn\autodeploy\prod
заменить тестовые почты чиновников на настоящие
перенести все связанные сущности в подпапки прод (при наличии там файлов, совпадающих по названиям в обоих папках)
Если проливка происходит напрямую в ветках test-version или master обязательно необходимо осущетсвлять обратный мерж в нижние ветки
после проливки на боевой проверить процесс хотя бы по одному сценарию, закрыть ишью.
