var NodeCache = require("node-cache" );
//var uuid = require("uuid");
var crypto = require('crypto');

var adminKeysCache = new NodeCache();
var cacheKey = 'admin-keys-map';
// ��� �������
var aAdminInn = [
	'3119325858'
	,'2943209693' //Белявцев
	,'3167410996' //Забрудский
        ,'2817305057' //Свидрань
        ,'3075311805' //Грек
        ,'3314612661' //Войт
        ,'2268819154' //Братусь Михаил Владимирович оператор ФО
        ,'1806101517' //Конных Юрий Николаевич оператор ФО
        ,'2007813996' //Шипов Александр Юрьевич оператор ФО
        ,'2181117011' //Тарасенко Александр Иванович оператор ФО
        ,'2451100643' //Дручкова Жанна Іванівна оператор ФО
        ,'2955913663' //Рыбкина Екатерина Николаевна Колл-центр
        ,'3017805029' //Аскерова Аида Александровна Колл-центр
        ,'3410000000' //Проскурова Олеся Олеговна Колл-центр-удален
        ,'3375301375' //Чепурко Сергей Сергеевич Колл-центр
        ,'3453103770' //Кордин Виталий Юрьевич Колл-центр
        ,'3384604904' //Левченко Юлия Вадимовна Колл-центр
        ,'3507906677' //Гавриш Олег Анатольевич Колл-центр
        ,'3318701324' //ФО Малолетнева Ульяна Евгеньевна
        ,'2819413260' //ФО Алексеенкова Анастасия Владимировна
        ,'3432314483' //БА Федько Анастасия Сергеевна оператор БО
        ,'3100218921' //БА Магоня Ирина Александровна оператор БО
        ,'3007605949' //БА Зимовец Полина Владимировна оператор БО
        ,'3118718406' //БА Салимова Лейли Александровна оператор БО
        ,'3347002733' //БА Божко Владимир Сергеевич супервизор
        ,'3233100559' //Горбань
        ,'3298407213' //Невстокай Олександр Сергійович оператор БО
        ,'2506700205' //Соколова Ирина Георгиевна оператор БО
        ,'3303004002' //Мельничук Анжелика Игоревна оператор БО		
        ,'3504302600' //Леник Елена Сергеевна колл-центр
        ,'3331201403' //Гуменюк Елена Сергеевна колл-центр
        ,'3382603546' //Самойленко Мария Леонидовна колл-центр
        ,'3253714017' //Дубровец Дмитрий Владимирович колл-центр
        ,'3489209489' //Третьяк Екатерина колл-центр
        ,'3324008718' //Кравчук Алексей колл-центр
        ,'3453807654' //Ставрат Станислав колл-центр
        ,'3413409424' //Гуляк Анастасия колл-центр
	,'3413908282' //Онбыш Екатерина Николаевна колл-центр
	,'3131622274' //Пиво Александр Владимирович колл-центр
	,'3563605200' //Белая Юлия Александровна колл-центр
	,'3385106334' //Майор Сергей Владимирович колл-центр
	,'3404814782' //Белик Яна Александровна колл-центр
        ,'3340312504' //Романькова Юлия Валериевна оператор ФО
        ,'3199006657' //Горб Игорь Валентинович оператор ФО
        ,'3139206241' //Голубь Ольга Вячеславовна оператор ФО
        ,'2794700544' //Момот Ольга Вячеславовна оператор ФО
        ,'3318210825' //Донець Олена Миколаївна оператор ФО
        ,'2947005183' //Гапоненко Ольга Вікторовна оператор ФО
        ,'3459105503' //Кабанова Юлиана Юрьевна колл-центр
        ,'3456105907' //Бокарева Анастасия Геннадьевна колл-центр
        ,'3270407642' //Тетянчук Алина Сергеевна колл-центр
        ,'3428100125' //Турковец Лидия Юрьевна колл-центр
        ,'3002518216' //Вовк Евгений Викторович колл-центр
        ,'3385507197' //Воронiн Олег Юрiйович колл-центр
        ,'3358515670' //Бруяка Андрей Николаевич колл-центр
        ,'2622113164' //Мина Наталья Германовна колл-центр
        ,'3377510065' //Солнцева Анна Николаевна колл-центр
        ,'3156100721' //Романова Татьяна Ивановна колл-центр
        ,'3338000515' //Сычев Андрей колл-центр
        ,'3440714805' //София Данилевич БА Тернополь
        ,'3221220890' //Яковлев Максим загран КрРог
        ,'3366802117' //Караблин Александр Дмитриевич оператор ФО
        ,'3538107120' //Юдушкина Надежда Юрьевна оператор ФО
        ,'3300820990' //Босов Алексей Александрович оператор ФО
        ,'3325810519' //Кандыбин Александр Олегович оператор ФО
        ,'3379712465' //Шелкович Анна Игоревна оператор ФО
        ,'3497808557' //Хорунжий Яков Богданович оператор ФО
        ,'3379716566' //Алсуфьева Ольга Витальевна оператор ФО
        ,'3500101529' //Кравченко Юлия Александровна оператор ФО
        ,'3475910267' //Филиппова Анастасия Юрьевна колл-центр
        ,"3290203582" //Лещенко Оксана Сергеевна оператор ФО
        ,"3345318071" //Подопригора Дмитрий Андреевич колл-центр
        ,"3409307027" //СИМОН АЛЕКСАНДРА СЕРГЕЕВНА ДМС ДнепрРайон
        ,"2811011402" //УСЕНКО ВАЛЕНТИНА НИКОЛАЕВНА ДМС ДнепрРайон
        ,"2612400336" //Август
        ,"2520400407" //Перебора Елена Николаевна оператор ФО
        ,"2209413811" //Яланський Алім Олександрович оператор ФО
        ,"3494104123" //Вискворцова Світлана Юріївна оператор ФО
        ,"2831100257" //Смоктий Кирилл Викторович БА
        ,"3214509257" //Кулиш Андрей Юрійович БА
        ,"3088623536" //Ставицький Валерій Дмитрович БА
        ,"3225017361" //Продан Юлия Георгиевна БА
        ,"3107215745" //Столбова Анна Юрьевна БА
        ,"3101717771" //Жиган Роман Сергеевич БА
        ,"2541900347" //Гермаш Анжела Володимирівна ЗАГС
        ,"3049907728" //Чигринець Юлія Юріївна ЗАГС
        ,"2249500648" //Хоменко Наталія Миколаївна ЗАГС
        ,"2778600188" //Граб Наталя Вікторівна ЗАГС
        ,"2539216269" //Кіча Оксана Семенівна ЗАГС
        ,"3332702409" //Шапіро Яна Андріївна ЗАГС
        ,"2664017580" //Сагайдак Валерія Геннадіївна ЗАГС
        ,"3274415665" //Мартиросян Яна Робертівна ЗАГС
        ,"3443403546" //Шоломіцька Катерина Олександрівна ЗАГС
        ,"2650822029" //Пряхіна Оксана Юріївна ЗАГС
        ,"3189309384" //Ляпченко Любов Олексіївна ЗАГС
        ,"2309401607" //Цяпало Наталія Михайлівна
        ,"3017805509" //Сидоренко Катерина Геннадіївна
        ,"2895119507" //Шеян Ганна Олександрівна
        ,"3273818166" //Слюсаренко Ірина Петрівна
        ,"2963801608" //Жилка Тетяна Павлівна
        ,"3139808662" //Бордюг Ганна Сергіївна 
        ,"3099807585" //Ніколаєнко Ольга Миколаївна 
        ,"3203800421" //Носова Ганна Анатоліївна
        ,"3191819764" //Дацько Катерина Сергіївна
        ,"3241718226" //Золотова Татьяна
        ,"2235509967" //Третяк Ольга Петрівна  ДРАЦС
        ,"3038024701" //Алєксєєва Олена Миколаївна  ДРАЦС
        ,"3165800702" //Жариченко Юлія Василівна ДРАЦС
        ,"2170410148" //Залевська Наталія Леонідівна  ДРАЦС
        ,"2956103047" //Цивата Мар’яна Володимирівна  ДРАЦС
        ,"2322517781" //Майхват Алла Василівна ДРАЦС
        ,"3202900661" //Колесник Дарина Олегівна  ДРАЦС
        ,"3085300444" //Медяник Вікторія Сергіївна ДРАЦС
        ,"3421208522" //Грань Марія Андріївна ДРАЦС
        ,"3351117004" //Заводовська Анастасія Ігорівна  ДРАЦС
        ,"3271016443" //Чичиркина Марія Миколаївна  ДРАЦС
        ,"2982303227" //Зеркаль Лілія Анатоліївна ДРАЦС
        ,"2999519965" //Вербовська Катерина Василівна ДРАЦС
        ,"3072400084" //Макогон Ірина Володимирівна ДРАЦС
        ,"3156715068" //Літвінова Тетяна Сергіївна ДРАЦС
        ,"2969708583" //Кошарова Оксана Олександрівна ДРАЦС
        ,"3151717264" //Молчанова Наталія Олексіївна ДРАЦС
        ,"3187520923" //Саєнко Наталя Юріївна ДРАЦС
        ,"3163127189" //Сковородка Надія Олександрівна ДРАЦС
        ,"2796300242" //Король Олена Михайлівна ДРАЦС
        ,"3018006729" //Карпенко Ольга Олександрівна ДРАЦС
        ,"3177515189" //Остапенко Наталія Володимирівна ДРАЦС
        ,"3293108543" //Денисюк Олена Миколаївна ДРАЦС
        ,"3210220627" //Пронько Людмила Володимирівна ДРАЦС
        ,"3420112300" //Суханова Вероніка Євгеніївна ДРАЦС
        ,"3094419782" //Ткач Олеся Геннадіївна ДРАЦС
        ,"3151522969" //Сербаєва Неля Анатоліївна ДРАЦС
        ,"3085517147" //Рогожникова Есміра Шахмірівна ДРАЦС
        ,"2762905506" //Коваленко Ліна Анатоліївна ДРАЦС
        ,"3148901683" //Кортікова Надія Віталіївна ДРАЦС
        ,"2652612209" //Богомолова Людмила Миколаївна ДРАЦС
        ,"3119700382" //Воробйова Олена Ігорівна ДРАЦС
        ,"3180400301" //Іщенко Юлія Павлівна ДРАЦС
        ,"3001108528" //Постоєнко Людмила Вікторівна  ДРАЦС
        ,"3099604989" //Явтушенко Ольга Анатоліївна  ДРАЦС
        ,"3390200942" //Балаба Валерія Андріївна ДРАЦС
        ,"2769004407" //Гольденберг Алла Анатоліївна ДРАЦС
        ,"3046508482" //Клепікова Катерина Павлівна ДРАЦС
        ,"3176104789" //Кучеренко Лариса Миколаївна ДРАЦС
        ,"2936610461" //Абальмасова Лариса Миколаївна ДРАЦС
        ,"3377701921" //Рябініна Марія Миколаїівна ДРАЦС
        ,"2923514989" //Єфіменко Юлія Олександрівна ДРАЦС
        ,"3148514529" //Смірницька Тамара Валентинівна ДРАЦС
        ,"2947019068" //Безвезюк Алла Володимирівна ДРАЦС
        ,"3126905423" //Золотова Ольга Леонідівна ДРАЦС
        ,"2850606927" //Касимова Тамара Володимирівна ДРАЦС
        ,"2900902409" //Шевченко Тетяна  Михайлівна ДРАЦС
        ,"2870722027" //Шевченко Олена Пилипівна ДРАЦС
        ,"2976303363" //Вікуліна Тетяна Вікторівна ДРАЦС
        ,"3267701229" //Олефір Яна Петрівна ДРАЦС
        ,"2776304328" //Коваленко Ангеліна Володимирівна ДРАЦС
        ,"3155500189" //Шевченко Вікторія Олександрівна  ДРАЦС
        ,"3148318821" //Колісник Яна Олександрівна  ДРАЦС
        ,"3365712981" //Франщук Вікторія Сергіївна  ДРАЦС
        ,"2808607440" //Баганець Антоніна Борисівна  ДРАЦС
        ,"3003804605" //Сабєльнікова Людмила Михайлівна ДРАЦС
        ,"3033400971" //Маковецький Михайло Павлович ДРАЦС
        ,"3057000486" //Підгайна Тетяна Михайлівна ДРАЦС
        ,"3406403065" //Лисиця Анна Дмитрівна ДРАЦС
        ,"3054700220" //Колот Тетяна Миколаївна ДРАЦС
        ,"2942005330" //Аксьонов Юрій Володимирович  ДРАЦС
        ,"2946216060" //Назаренко Леся Володимирівна ДРАЦС
        ,"3207802703" //Іванченко Дар’я Олександрівна ДРАЦС
        ,"3152720101" //Симонович Юлія Олександрівна  ДРАЦС
        ,"3350300062" //Новицька Яна Леонідівна ДРАЦС
        ,"3417101600" //Макарчук Анна Олександрівна ДРАЦС
        ,"3050113509" //Стрічка Олена Олександрівна ДРАЦС
        ,"3139601404" //Таран Альона Сергіївна ДРАЦС
        ,"2240920007" //Акулова Олена Володимирівна   ДРАЦС
        ,"2762412587" //Папченко Світлана Михайлівна  ДРАЦС
        ,"3374913647" //Дмитріва Анна Степанівна ДРАЦС
        ,"2344008365" //Іосипова Наталя Сергіївна ДРАЦС
        ,"2647107661" //Береза Тетяна Григорівна ДРАЦС
        ,"2779107920" //Соколенко Анжела Іванівна ДРАЦС
        ,"2413108167" //Потарська Світлана Ярославівна ДРАЦС
        ,"3272805622" //Катериніч Юлія Миколаївна ДРАЦС
        ,"3369213003" //Кукса Оксана Олегівна ДРАЦС
        ,"2670806559" //Кіріченко Світлана Іванівна ДРАЦС
        ,"2679706167" //Шамбарова Світлана Василівна  ДРАЦС
        ,"3149218849" //Голомідова Тетяна Євгеніївна  ДРАЦС
        ,"3398608488" //Аранська Катерина Олександрівна  ДРАЦС
        ,"2971012825" //Швайко Олена Миколаївна ДРАЦС
        ,"2391615327" //Турченко Валентина Іванівна ДРАЦС
        ,"3210801703" //Федоренко Альона Анатоліївна ДРАЦС
        ,"2560407220" //Богданова Альона Степанівна  ДРАЦС
        ,"3102119981" //Баранова Катерина Іванівна  ДРАЦС
        ,"2988609701" //Титикало Олександра Юріївна  ДРАЦС
        ,"3275313322" //Золотар Анна Миколаївна  ДРАЦС
        ,"2754414187" //Кислова Вікторія Петрівна  ДРАЦС
        ,"3207318822" //Овдієнко Тетяна Володимирівна  ДРАЦС
        ,"2963909182" //Солоха Олена Олексіївна  ДРАЦС
        ,"2201109749" //Грушина Тетяна Петрівна  ДРАЦС
        ,"3459703741" //Свириденко Діана Веніамінівна ДРАЦС
        ,"3456711522" //Якименко Анастасія Юріївна ДРАЦС
        ,"2886305246" //Алієва Олена Віталіївна  ДРАЦС
        ,"3343412280" //Богуславська Вікторія Михайлівна ДРАЦС
        ,"2561606741" //Ромашкіна Оксана Олександрівна ДРАЦС
        ,"2933216960" //Бережнова Тетяна Леонідівна  ДРАЦС
        ,"3236521424" //Валіахметова Тетяна Олександрівна ДРАЦС
        ,"2523307061" //Колкунова Тетяна Іванівна ДРАЦС
        ,"3107209021" //Пазіна Людмила Миколаївна ДРАЦС
        ,"3285713568" //Моренець Ольга Вікторівна ДРАЦС
        ,"3413409084" //Павленко Алина Викторовна КоллЦентр ДМР
];

var getAdminKeys = function () {
	var result = adminKeysCache.get(cacheKey);
	if (!result) {
		result = {};
		setAdminKeys(result);
	}
	return result;
};

var setAdminKeys = function (value) {
	adminKeysCache.set(cacheKey, value);
};

var generateAdminToken = function (inn) {
	var unhashed = inn + (new Date()).toString();
	var result = crypto.createHash('sha1').update(unhashed).digest('hex'); //uuid.v1();
	var keys = getAdminKeys();
	keys[inn] = result;
	setAdminKeys(keys);
	return result;
};

var isAdminInn = function(inn) {
	return aAdminInn.indexOf(inn) > -1;
};

var Admin = function() {

};

Admin.generateAdminToken = generateAdminToken;
Admin.isAdminInn = isAdminInn;

module.exports = Admin;
